Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Префикс имени — в это поле вводится префикс добавляемый к имени присоединенных полей таблиц, состав именного префикса следует правилу Параметров полей набора данных.
en: Name prefix: the prefix added to the name of the joined table fields is specified in this field. Composition of the name prefix conforms to the rules of Features of data set fields.

source: Префикс метки — в это поле вводится префикс добавляемый к метке не сопоставленных полей таблиц, именуется согласно Параметрам полей набора данных.
en: Caption prefix: the prefix added to the caption of the table fields that are not mapped is specified in this field. It is named according to Features of data set fields.

source: Префикс метки — в это поле вводится префикс добавляемый к метке присоединенных полей таблиц, именуется согласно Параметрам полей набора данных.
en: Caption prefix: the prefix added to the caption of the joined table fields is specified in this field. It is named according to Features of data set fields.

source: При активации — при активации узла будет производится кэширование всего набора данных.
en: On activation: on the node activation, the whole data set will be cached.

source: При активации — при активации узла будет производится кэширование поля набора данных.
en: On activation: on the node activation, the data set field will be cached.

source: При обращении — будет производится кэширование поля при первом запросе его данных последующими узлами сценария или визуализатором.
en: While handling: the field will be cached in the case of the first request of its data by the subsequent workflow nodes or visualizer.

source: При обращении — будет производится кэширование тех полей выходного набора, данные которых запрошены последующими узлами сценария или визуализатором.
en: While handling: only those output data set fields will be cached data of which are requested by the subsequent workflow nodes or visualizer.

source: Приватный ключ — путь к файлу с приватным ключом.
en: Private key: path to the file with the private key.

source: Пример использования порта порядка выполнения.
en: Example of use of the execution order port.

source: Пример использования порта связи наследования.
en: Example of use of the heritage connection port.

source: Пример использования порта связи ссылки.
en: Example of use of the reference connection port.

source: Пример подключения и работы с БД
en: Example of the DB connection and operation

source: Пример сценария.
en: Workflow example

source: Пример сценария
en: Workflow Example

source: Пример:
en: Example:

source: Пример — позволяет ввести пример значения, чтобы проверить корректность настроенного форматирования.
en: Example enables to enter the value example to check correctness of the configured formatting.

source: Примеры написания строк подключения к разным источникам данных
en: Examples of writing of connection strings for different data sources.

source: Примечание:
en: Note:

source: Примечание: В Windows 7 эти настройки можно задать: Панель управление -> Часы, язык и регион -> Язык и региональные стандарты.
en: Note: In Windows 7 these settings can be set as follows: Control panel -> Hours, language and region -> Language and regional standards.

source: Примечание: В выражении возможно использовать ссылки на ранее вычисленные выражения, т.е. находящиеся выше в списке выражений.
en: Note: It is possible to use references to the expressions calculated earlier in the expression, namely, the expressions that are higher in the list of expressions.

source: Примечание: В качестве LDAP сервера может использоваться как Active Directory, так и OpenLDAP.
en: Note: Both Active Directory and OpenLDAP can be used as the LDAP server.

source: Примечание: В случае, если данных много, то показатели Гистограмма, Диаграмма размаха, Порядковые статистики и Уникальные значения не отображаются.
en: Note: If there is much data, such indicators as Histogram, Box plot, Order statistics and Unique values are not displayed.

source: Примечание: Визуализатор Конечные классы может использоваться только с узлом Конечные классы.
en: Note: TheCoarse classes visualizer can be used only with the Coarse classes node.

source: Примечание: Внутри Подмодели так же имеется возможность использовать переменные Сценария.
en: Note: It is also possible to use the Workflow variables inside the Supernode.

source: Примечание: Возможна публикация нескольких подмоделей (узлов) в различных пакетах.
en: Note: It is possible to publish several supernodes (nodes) in different packages.

source: Примечание: Гистограмма не отображается, если в измерении содержится большое количество уникальных значений (для дискретных полей).
en: Note: The histogram is not displayed if there are too many unique values in the dimension (for the discrete fields).

source: Примечание: Для вывода данных в окно предпросмотра обрабатывается только первая тысяча строк исходного набора.
en: Note: To show data in the preview window, only the first thousand rows of the source data set are processed.

source: Примечание: Для каждого непрерывного параметра в структуре Нейросети будет создан один вход, в то время как для каждого дискретного – столько входов, сколько у данного параметра имеется различных уникальных значений.
en: Note: One input will be created for each continuous parameter in the Neural Network structure, whereas each discrete one will be provided with the inputs the number of which will comply with the number of different unique values of this parameter.

source: Примечание: Для каждого непрерывного параметра в структуре нейросети будет создан один вход, в то время как для каждой дискретной – столько входов, сколько у данного параметра имеется различных уникальных значений.
en: Note: One input will be created for each continuous parameter in the neural network structure, whereas each discrete one will be provided with the inputs the number of which will comply with the number of different unique values of this parameter.

source: Примечание: Для подключения к базе данных используются библиотеки sqlite3.dll и sqlcipher.dll, совпадающие по разрядности с приложением/сервером Loginom.
en: Note: To provide connection to the database, sqlite3.dll and sqlcipher.dll libraries are used. Their bitness matches the Loginom application/ server bitness.

source: Примечание: Для подключения к базе данных клиенты или драйвер ODBC должны быть той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: To provide connection to the database, the clients or ODBC driver must be with the same bitness as the Loginom application/server bitness.

source: Примечание: Для подключения к базе данных необходима установка Microsoft Office или Microsoft Access Database Engine той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: To provide connection to the database, it is required to install Microsoft Office or Microsoft Access Database Engine with the same bitness as the Loginom application/server bitness.

source: Примечание: Для подключения к базе данных необходима установка файлов клиентской библиотеки (DLL) той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: To provide connection to the database, it is required to install the client library files (DLL) with the same bitness as the Loginom application/server bitness.

source: Примечание: Для подключения к базе данных через клиент СУБД необходима установка файлов клиентской библиотеки (DLL) той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: To provide connection to the database via DBMS client, it is required to install the client library files (DLL) with the same bitness as the Loginom application/server bitness.

source: Примечание: Для подключения необходима установка драйвера ODBC той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: To provide connection, it is required to install the ODBC driver with the same bitness as the Loginom application/server bitness.

source: Примечание: Для подключения​к базе данных необходима установка толстого клиента 1С той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: To provide connection to the database, it is required to install the thick 1C client with the same bitness as the Loginom application/server bitness.

source: Примечание: Если замена одного значения может быть произведена по условиям нескольких строк таблицы замен, то приоритет имеет первая из них.
en: Note: If one value can be replaced according to conditions of several replacement table rows, the first one must prevail.

source: Примечание: Если используется клмент СУБД, то он должен быть той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: If DBMS client is used, it must be with the same bitness as the Loginom application/server bitness.

source: Примечание: Если нужно переименовать папку, то создается новая папка куда копируется содержимое старой, затем старая папка удаляется.
en: Note: If it is required to rename a folder, the new folder is created where the contents of the old one is copied. Then the old folder is deleted.

source: Примечание: Замена по точному совпадению имеет приоритет перед заменой по регулярному выражению.
en: Note: Replacement by exact match prevails over replacement by regular expression.

source: Примечание: Изменяя вышеперечисленные опции, визуализация гистограммы изменяется только в детализированном окне, а в основном окне визуализатора останется прежней.
en: Note: After the changes of options specified above, the histogram visualisation changes only in the detailed window, whereas it is the same in the main visualizer window.

source: Примечание: Инструменты работы с веб-сервисами доступны только в серверных редакциях Loginom.
en: Note: The web service tools are available only in the server Loginom editions.

source: Примечание: Кнопка Показать/скрыть инспектор свойств всегда находится в крайней правой позиции на панели инструментов.
en: Note: Show/hide property inspector button is always located in the far right position on the toolbar.

source: Примечание: Количество записей набора данных, к которому применяется данный визуализатор, можно узнать в графе Кол-во строк данных, расположенной в правой части панели инструментов, слева от кнопки Гистограмма.
en: Note: It is possible to define the number of records of the data set to which this visualizer is applied in Row count of data column located in the right toolbar part, to the left from the Histogram button.

source: Примечание: Модуль Пакета по умолчанию имеет модификатор доступа "Открытый (доступен во всех пакетах)".
en: Note: The Package module has the "Public" (available in all packages) access modifier by default.

source: Примечание: На компьютере пользователя должен быть установлен клиент СУБД той же разрядности, что и разрядность приложения/сервера Loginom.
en: Note: It is required to install DBMS client on the user computer with the same bitness as the Loginom application/server bitness.

source: Примечание: Параметры, такие как Администрирование, Проектирование сценариев, Просмотр отчетов, Доступ ко всем файлам, Интерактивный режим, Режим службы и Заблокирован, отмечаются в окне создания/редактирования пользователя флажком в чекбоксе, а в таблице подраздела отмечены символом "•", параметр Аутентификация выбирается с помощью выпадающего списка в окне создания/редактирования пользователя и в таблице подраздела отображает выбранный способ Аутентификации пользователя.
en: Note: Such parameters as Administration, Workflows design, View reports, Access to all files, Interactive mode, Service mode and Blocked are selected with a checkbox in the window used for creation/edition of a user, and they are selected with "•" character in the subsection table, Authentification parameter is selected from the drop-down list in the window used for creation/edition of a user, and it displays the selected method of the user Authentification in the subsection table.

source: Примечание: Порядок колонок Свойство и Значение изменить нельзя.
en: Note: It is not possible to change the order of the Properties and Value columns.

source: Примечание: Поскольку для подключения используется встроенный драйвер, то установка клиента СУБД не требуется.
en: Note: As the inbox driver is used for connection, it is not required to install DBMS client.

source: Примечание: При нажатии на кнопку Предпросмотра активируются все входные порты.
en: Note: It is possible to activate all input ports by pressing Preview button.

source: Примечание: При открытом окне Инспектора свойств часть кнопок на панели инструментов может не помещаться.
en: Note: When the Property inspector window is opened, there can be not enough place for some buttons on the toolbar.

source: Примечание: При переходе по данной ссылке придется ввести соответствующий логин и (если есть) пароль.
en: Note: When following this link, it is required to enter corresponding login and password (if any).

source: Примечание: При работе в редакции Personal и Community файловый менеджер отсутствует, так как это версии программ предназначенные для персональной обработки, но пользователь имеет доступ ко всему файловому пространству локального компьютера.
en: Note: When using the Personal and Community editions, the file manager is not available as these program versions are designated for the personal processing but a user has access to the whole file space of the local computer.

source: Примечание: При удалении пользователя есть возможность сохранить его папку со всем ее содержимым, в таком случае просматривать ее содержимое смогут пользователи у которых включен параметр Полный доступ к файловому хранилищу.
en: Note: When deleting a user, it is possible to save his folder with its contents. In this case, the users with the enabled File storage full access parameter can view its contents.

source: Примечание: Проверка совместимости с версией 8.0 не проводилась.
en: Note: Compatibility with version 8.0 was not tested.

source: Примечание: Размер используемой оперативной памяти (RAM) ограничен 2 GB (ограничение платформы x86).
en: Note: The size of the used RAM is limited to 2 GB (restriction of platform x86).

source: Примечание: Регулярное выражение — это шаблон поиска последовательностей символов.
en: Note: The regular expression is a template used for search for sequences of characters.

source: Примечание: Режим работы калькулятора Выражение или JavaScript выбирается для всех полей, т.е. нельзя установить для одного поля синтаксис Выражение, а для другого JavaScript.
en: Note: It is required to select Calculator mode Expression or JavaScript for all fields, namely, it is not possible to set Expression syntax for one field, and JavaScript - for another.

source: Примечание: Ряд сервисов предоставляет ответ в виде вложенного XML.
en: Note: Some services give response in the form of nested XML.

source: Примечание: Следует учитывать, что Loginom использует формат хранения данных в LGD-файлах отличный от использовавшегося ранее в платформе Deductor файлов DDF.
en: Note: It is required to take into account that the format of data storage in the LGD files used in Loginom differs from the format of the DDF files in the Deductor platform used earlier.

source: Примечание: Статус поля изменить нельзя, он только отражает настройки в соответствующем узле Конечные классы.
en: Note: It is not possible to change the field status. It only displays settings in the corresponding Coarse classes node.

source: Примечание: Тип данных Переменный следует методу агрегации того типа данных который был выбран в мастере настройки перед ним.
en: Note: The Variable Data type follows the aggregation method of the data type that has been selected in the wizard before.

source: Примечание: Удалить корневой узел Root нельзя.
en: Note: It is not possible to delete Delete root node Root.

source: Примечание: Формат хранения LGD разработан специально для использования с Loginom и обеспечивает наивысшую скорость импорта и экспорта данных.
en: Note: The LGD storage format has been elaborated specially for usage with Loginom. It provides the highest data import and export speed.

source: Примечание: в Таблица Таблице и Форма Форме можно менять порядок следования столбцов.
en: Note: It is possible to change the columns sequence order in Table Table and Form Form.

source: Примечание: в отличии от компонента JavaScript в Калькуляторе не поддерживается объект Promise.
en: Note: As opposed to the component of JavaScript in Calculator the Promise object is not supported.

source: Примечание: в списке будут доступны только используемые факты и измерения.
en: Note: Only used measures and dimensions will be available only in the list.

source: Примечание: все доступные параметры детальных настроек можно задавать с помощью переменных.
en: Note: All available parameters of the detailed settings can be set by means of variables.

source: Примечание: все доступные параметры настройки линейной регрессии можно задавать с помощью переменных.
en: Note: All available parameters of the linear regression configuration can be set by means of variables.

source: Примечание: все доступные параметры настройки логистической регрессии можно задавать с помощью переменных.
en: Note: All available parameters of the logistic regression configuration can be set by means of variables.

source: Примечание: для минимизации возможных проблем подключения к веб-сервису сторонними клиентами рекомендуется использовать в имени публикуемого пакета только символы английского алфавита, числа и символ подчеркивания.
en: Note: In order to minimise possible problems of connection to the web service using the external clients, it is recommended to use only the English alphabet characters, numbers and underscore character in the name of the published package.

source: Примечание: для отображения управляющих портов необходимо в контекстном меню узла выбрать пункт "Показать порт управляющих переменных".
en: Note: To display the control ports, it is required to select the following item in the context menu of the node: "Show control variables port".

source: Примечание: если конструкция подстановки заключена в кавычки, то в приоритете работают кавычки, а не подстановка.
en: Note: if the substitution construction is in quotation marks, quotation marks are prioritized but not the substitution.

source: Примечание: если необходимо осуществлять подбор параметров для больших входных объемов или сложных моделей, можно включить только подбор структуры либо только степени регуляризации, сократив время на обучение.
en: Note: If it is required to select parameters for the large input volumes or complex models, it is possible to enable only the structure selection, or only decay degree reducing the time spent on training.

source: Примечание: если отключить вывод элемента и не задать условий и/или значений, то после сохранения списка этот элемент будет перемещен обратно в список Доступные элементы.
en: Note: if the item showing is disabled, and no conditions and/or values are specified, upon the list saving, this item will be moved back to the Available items list.

source: Примечание: из списка выбора исключаются поля/переменные уже присутствующие в таблице, а также поля/переменные с несовместимым типом данных.
en: Note: The fields/variables that are already available in the table and also fields/variables with incompatible data type are excluded from the selection list.

source: Примечание: имя узла задается при настройке модификатора доступа.
en: Note: The node name is set when configuring access modifier.

source: Примечание: количество записей набора данных, к которому применяется данный визуализатор, можно узнать в графе Кол-во строк данных, расположенной в правой части панели инструментов слева от кнопки Гистограмма Гистограмма.
en: Note: It is possible to define the number of records of the data set to which this visualizer is applied in Row count of data column located in the right toolbar part, to the left from the Histogram Histogram button.

source: Примечание: команды "Сохранить", "Сохранить как", "Закрыть пакет" доступны в случае открытого Пакета.
en: Note: "Save", "Save as", "Close package" commands are available in the case of the opened Package.

source: Примечание: можно открыть раннее открытый Пакет, нажав на его имя.
en: Note: it is possible to open previously opened Package by pressing its name.

source: Примечание: на данной панели содержится информация о текущей версии приложения и имя пользователя, под которым открыта текущая сессия (в случае серверной версии Loginom).
en: Note: this panel contains information on the current application version and user name under which the current session is opened (in the case of the server Loginom version).

source: Примечание: нахождение базового узла возможно только в том случае, если он расположен в пределах текущей области построения Сценария.
en: Note: It is possible to find the base node only if it is located within the current Workflow construction area.

source: Примечание: опцию Останов при нулевой ошибки классификации можно отключить, т.к. правильная классификация всех примеров не всегда означает наилучшую структуру Нейросети: оптимизатору можно дать возможность подобрать сеть с лучшей обобщающей способностью (например, с меньшим числом нейронов или сильнее регуляризованную), но при этом не обязательно с нулевой ошибкой классификации.
en: Note: Stop at zero classification error option can be disabled because the correct classification of all examples does not always mean the best structure of the Neural Network, namely, the optimizer can be allowed to select the network with the best generalization ability (for example, with the least number of neurons or more regularizable) but not necessarily with zero classification error.

source: Примечание: опция <Не задано> при именовании порта доступна в случае, если этот порт единственный входной или выходной.
en: Note: <Unspecified> option is available while the port naming if this port is the only input or output one.

source: Примечание: по умолчанию в качестве варианта отображения выбирается идущий первым по списку.
en: Note: The representation option that is the first one on the list is selected by default as the representation option.

source: Примечание: подробнее о пакетном выполнении сценариев и параметрах пакетного выполнения /Teach и /Node (см.
en: Note: More detailed information on the batch processing of workflows and /Teach and /Node batch processing parameters is provided (refer to

source: Примечание: поскольку Подмодель (или Цикл) также может быть вложен в другую Подмодель, и эта вложенность не ограничена, то, таким образом, может образоваться иерархия вложенности, на вершине которой расположена Подмодель верхнего уровня.
en: Note: As the Supernode (or Loop) also can be nested into another Supernode, and this nesting is not limited, the nesting hierarchy can be created in this casr. The upper level Supernode is located on its op.

source: Примечание: при использовании пробельных символов в выражении, задающем значение параметра, все выражение необходимо заключить в двойные кавычки.
en: Note: When using the space characters in the expression that enables to set the parameter value, it is required to enclose the whole expression in double quotes.
